Revit 2027 API
CriticalPathIterator Methods
The CriticalPathIterator type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetCurrent |  Gets the analytical segment id at the current iterating position.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next downstream segment on the critical path.
Reset |  Resets the iterator to the beginning segment.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
CriticalPathIterator Class
Autodesk.Revit.DB.Analysis Namespace